app/controllers/regions_controller.rb

SELECT "regions".* FROM "regions"  ORDER BY "regions"."id" ASC
---
def index
  @regions = Region.order(:id)

SELECT  "regions".* FROM "regions" WHERE "regions"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "spots".* FROM "spots" WHERE "spots"."region_id" = $1  ORDER BY "spots"."id" ASC  [["region_id", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."region_id" = $1  ORDER BY "reviews"."id" ASC  [["region_id", 1]]
SELECT "reviews".* FROM "reviews"
---
def show
  @region = Region.find params[:id]

  @spots = @region.spots.order(:id)
  @reviews = @region.reviews.order(:id => :desc)
  rating_sum = 0
  @reviews.each do |r|

INSERT INTO "regions" ("name", "address", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
def create
  @region = Region.create region_params

SELECT  "regions".* FROM "regions" WHERE "regions"."id" = $1 LIMIT 1  [["id", 1]]
---
def edit
  @region = Region.find params[:id]

SELECT  "regions".* FROM "regions" WHERE "regions"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "regions" SET "address" = $1, "updated_at" = $2 WHERE "regions"."id" = $3  [["address", "macleay river ????"], ["updated_at", "2016-05-30 10:17:55.112572"], ["id", 3]]
---
def update
  region = Region.find params[:id]
  region.update region_params

SELECT  "regions".* FROM "regions" WHERE "regions"."id" = $1 LIMIT 1  [["id", 3]]
DELETE FROM "regions" WHERE "regions"."id" = $1  [["id", 3]]
---
def destroy
  region = Region.find params[:id]
  region.destroy