app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("rating", "content", "user_id", "region_id", "avatar", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["rating", 1], ["content", "asdfsd"], ["user_id", 4], ["region_id", 1], ["avatar", "coneice.png"], ["created_at", "2016-05-30 08:43:23.670887"], ["updated_at", "2016-05-30 08:43:23.670887"]]
---
def create
  # region = Region.find_by :id => params[:review][:region_id]
  if params[:file]
    cloudinary = Cloudinary::Uploader.upload( params[:file] )
    @review.link = cloudinary["url"]
  end
  @review = Review.new review_params
  @review.save!

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT 1  [["id", 18]]
---
def edit
  @review = Review.find params[:id]

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT 1  [["id", 8]]
UPDATE "reviews" SET "rating" = $1, "content" = $2, "updated_at" = $3 WHERE "reviews"."id" = $4  [["rating", 20], ["content", "Updated"], ["updated_at", "2016-05-29 16:41:53.233141"], ["id", 8]]
---
def update
  # region = Region.find_by :id => params[:review][:region_id]
  review = Review.find params[:id]
  if params[:file]
    cloudinary = Cloudinary::Uploader.upload( params[:file] )
    review.link = cloudinary["url"]
  end
  review.update review_params

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 1]]
---
def destroy
  review = Review.find params[:id]
  region = review.region_id
  review.destroy